#define _CRT_SECURE_NO_WARNINGS

#include <stdio.h>
#include <stdlib.h>
#include <string.h>

struct book																		//도서관리 프로그램 구조체 설정
{
	int num;
	char title[40];
	char author[40];
	char publisher[40];
	int price;
};
int HomeMenu(int h);															// 초기화면 함수 선언
void AddBook(struct book* plist, int* i);
int size = 100;
void BookList(struct book* plist);												// 도서리스트 확인 함수 선언
void SearchBook(struct book* plist);											// 도서검색 함수 선언
void Exit(int);																	// 프로그램 종료 함수 선언
void Printbook(struct book* plist);												// 도서목록 확인을 위한 함수 선언
int j, i;																		// 전역변수 j 선언(printbook 함수사용) 
int main()
{
	struct book list[100]; //구조체 배열 선언 
	int f = 0;
	while (1)
	{
		int menu = 0;
		menu = HomeMenu(menu);													// 초기화면 함수 호출
		switch (menu)															// 메뉴 반복		
		{
		case 1:																	// 도서등록 메뉴
			AddBook(list, &i);													// 도서 추가 함수 호출
			break;																
		case 2:																	// 등록된 도서 리스트 확인 메뉴
			BookList(list, i);													// 리스트 확인 함수 호출
			break;
		case 3:																	// 도서 검색 메뉴
			SearchBook(list, i);												// 도서 검색 함수 호출
			break;
		case 0:																	// 관리프로그램 종료 메뉴
			Exit(f);															// 종료 함수 호출
			break;
		}
	}
}

int HomeMenu(int m)																// 초기화면 함수 정의
{
	printf("-----------------------------------------------------------------------------------------------------------------------\n");
	printf("\n");
	printf("                                    도     서     관    리     프    로    그    램                                    \n");
	printf("\n");
	printf("-----------------------------------------------------------------------------------------------------------------------\n");
	printf("\n");
	printf("                                    메                                           뉴                                    \n");
	printf("\n");
	printf("-----------------------------------------------------------------------------------------------------------------------\n");
	printf("\n");
	printf("  1.  도   서   등   록\n");
	printf("\n");
	printf("  2.  도   서   목   록   확   인\n");
	printf("\n");
	printf("  3.  도   서   검   색\n");
	printf("\n");
	printf("  4.  도   서   삭   제\n");
	printf("\n");
	printf("  0.  프   로   그   램   종   료\n");
	printf("\n");
	printf("-----------------------------------------------------------------------------------------------------------------------\n");
	printf("\n");
	printf("  작 업 하 실 번 호 를 입 력 하 세 요 : ");
	scanf(" %d", &m);													// 작업 번호 입력 요청
	printf("\n");
	return m;															// scanf를 통해 입력받은 값을 리턴 값으로 출력
}
void AddBook(struct book* plist, int* i)							// 도서 추가 함수 정의 함수 매개 변수로 구조체 list배열을 포인터로 받으며, 배열의 열에 해당하는 i도 포인터로 받음. 
{
	printf("-----------------------------------------------------------------------------------------------------------------------\n");
	printf("\n");
	printf("                                 도             서              등             록                                      \n");
	printf("\n");
	printf("-----------------------------------------------------------------------------------------------------------------------\n");
	while (size != NULL) {
		if (*i < size)													// size는 100으로 되어 있기 때문에 2차원 배열의 i열이 100개보다 작을 경우 계속 등록 진행.
		{
			printf("\n");
			printf("  등록번호를 입력하세요 : ");
			scanf("%d", &(plist[*i].num));
			printf("\n");
			printf("  등록할 책의 이름을 입력하세요(40자이내) : ");
			scanf(" %40[^\n]s", plist[*i].title);
			printf("\n");
			printf("  등록할 책의 저자를 입력하세요(40자이내) : ");
			scanf(" %40[^\n]s", plist[*i].author);
			printf("\n");
			printf("  등록할 책의 출판사를 입력하세요(40자이내) : ");
			scanf(" %40[^\n]s", plist[*i].publisher);
			printf("\n");
			printf("  등록할 책의 가격을 입력하세요(숫자입력) : ");
			scanf("  %d", &(plist[*i].price));
			printf("\n");
			printf("-----------------------------------------------------------------------------------------------------------------------\n");
			printf("\n");
			printf("                         등        록        되         었         습         니         다.                           \n");
			printf("\n");
			printf("-----------------------------------------------------------------------------------------------------------------------\n");
			(*i)++;
			int a = 0;
			while (size != NULL)												// 책 등록할때마다 메뉴로 돌아가지 않고, 계속 등록
			{
				printf("  계속 등록하시려면  '1'  메뉴로 돌아가시려면   '2'  눌러주세요  :     ");			// 계속 등록여부 확인
				scanf("%d", &a);
				if (a == 2)																						// 2번을 누를 경우 메뉴로 돌아감
				{
					break;																				// 이중 while문 루프 종료
				}
				else if (a != 1)
				{
					printf("-----------------------------------------------------------------------------------------------------------------------\n");
					printf("\n");
					printf("                                잘    못    입    력    하   셨   습   니   다.                           \n");
					printf("\n");
					printf("-----------------------------------------------------------------------------------------------------------------------\n");
				}
				else { break; }
			}
		}
		else                                                                        // i열이 100보다 크거나 같을 경우 등록 불가 문구 출력 
		{
			printf("-----------------------------------------------------------------------------------------------------------------------\n");
			printf("\n");
			printf("         더       이        상        등        록        할        수        없        습        니        다.        \n");
			printf("\n");
			printf("-----------------------------------------------------------------------------------------------------------------------\n");
			return;
		}
	}
}

void BookList(struct book* plist)													// 등록된 book리스트를 확인 할 수 있는 함수 정의
{
	if (i == 0)																		// AddBook 함수에서 등록된 i열이 0일 경우 아래 문구 출력
	{
		printf("-----------------------------------------------------------------------------------------------------------------------\n");
		printf("\n");
		printf("              등        록        된        책        이        없        습        니        다.                      \n");
		printf("\n");
		printf("-----------------------------------------------------------------------------------------------------------------------\n");
	}
	else                                                                                    // AddBook 함수에서 등록된 책의 리스트 확인.
	{
		printf("-----------------------------------------------------------------------------------------------------------------------\n");
		printf("\n");
		printf("                             도        서         목        록         확         인                                   \n");
		printf("\n");
		printf("-----------------------------------------------------------------------------------------------------------------------\n");
		printf("\n");
		printf("%3s %20s %33s %33s %20s\n", "NO", "책제목", "저자명", "출판사명", "가격");				// printf 출력되는 글자 정렬
		printf("\n");
		printf("-----------------------------------------------------------------------------------------------------------------------\n");
		for (j = 0; j < i; j++)												// 등록 리스트 확인을 위해 반복문 사용
		{
			Printbook(plist);
			//printf("%3d %20s %33s %33s %21d\n\n", plist[j].num, plist[j].title, plist[j].author, plist[j].publisher, plist[j].price);
		}
		printf("\n");
		printf(" 등록된 도서는 총 %d 권 입니다.\n", i);							// i열을 통해 총 등록된 책의 수 확인
	}
}
void SearchBook(struct book* plist)										// 책 검색을 위한 함수 정의
{
	char search[40];															// 40자까지 검색이 가능한 Search 변수 선언
	printf("-----------------------------------------------------------------------------------------------------------------------\n");
	printf("\n");
	printf("                   검   색   하   실   책   제   목   이   나   저   자   명   을   입   력   하   세   요.            \n");
	printf("\n");
	printf("-----------------------------------------------------------------------------------------------------------------------\n");
	printf(" 검색어 입력 :  ");
	scanf(" %40[^\n]s", &search);												// 띄어쓰기 포함 40자까지 검색 입력
	printf("\n");

	if (i == 0)																	// AddBook에서 등록된 책이 없을 경우 아래 출력문 출력
	{
		printf("-----------------------------------------------------------------------------------------------------------------------\n");
		printf("\n");
		printf("                              등     록     된     책     이     없     습     니     다.                              \n");
		printf("\n");
		printf("-----------------------------------------------------------------------------------------------------------------------\n");
	}
	else                                                                        
	{
		printf("***********************************************************************************************************************\n");
		printf("\n");
		printf("                              검              색               결                 과                                   \n");
		printf("\n");
		printf("***********************************************************************************************************************\n");
		printf("-----------------------------------------------------------------------------------------------------------------------\n");
		printf("\n");
		printf("%3s %20s %33s %33s %20s\n", "NO", "책제목", "저자명", "출판사명", "가격");
		printf("\n");
		printf("-----------------------------------------------------------------------------------------------------------------------\n");
		for (j = 0; j < i; j++)															
		{
			if (strcmp(search, plist[j].title) == 0 || strcmp(search, plist[j].author) == 0)	// 책 제목 또는 저자가 search에 입력된 글자비교해 값이 0일 경우 등록된 책 목록 출력 
			{
				Printbook(plist);
				//printf("%3d %20s %33s %33s %21d\n\n", plist[j].num, plist[j].title, plist[j].author, plist[j].publisher, plist[j].price);
			}
			else                                                                                // 아닐 경우 아래 문구 출력하며 빠져나옴
			{
				printf("\n"); 
				printf("\n");
				printf("                                      검 색 하 신 책 을 찾 을 수 없 습 니 다.                                          \n");
				printf("\n");
				printf("\n");
				break;
			}
		}
	}
}
void Exit(int e)																			// 종료함수 정의
{
	printf("-----------------------------------------------------------------------------------------------------------------------\n");
	printf("\n");
	printf("          도    서    관    리    프    로   그    램    을    종    료    하    시    겠    습    니   까?            \n");
	printf("\n");
	printf("-----------------------------------------------------------------------------------------------------------------------\n");
	while (1)
	{
		printf("   종료하려면  1번   계속하려면   2번을 눌러주세요  :     ");
		scanf("%d", &e);
		printf("\n");

		if (e == 1)																				// 종료 확인 후 종료 진행.
		{
			printf("-----------------------------------------------------------------------------------------------------------------------\n");
			printf("\n");
			printf("                     프      로      그      램      을      종      료      합      니      다.                       \n");
			printf("\n");
			printf("-----------------------------------------------------------------------------------------------------------------------\n");
			exit(0);
		}
		else if (e == 2)
		{
			break;
		}																						// empty
		else
		{
			printf("-----------------------------------------------------------------------------------------------------------------------\n");
			printf("                       잘      못      입      력      하      셨      습      니      다.                             \n");
			printf("-----------------------------------------------------------------------------------------------------------------------\n");
		}
	}
}
void Printbook(struct book* plist)
{
	printf("%3d %20s %33s %33s %21d\n\n", plist[j].num, plist[j].title, plist[j].author, plist[j].publisher, plist[j].price);
}
